## Plan Result (dev-backendappgateway)




<pre><code>Plan: 2 to add, 9 to change, 0 to destroy.</code></pre>

* Create
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
* Update
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;darts-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;darts-gateway&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;lgy-iac-web&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;toffee-recipe-backend&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-bookings-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-notification-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-test-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-user-api&#34;]
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;vh-video-api&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be created
  + resource "azurerm_application_gateway" "ag" {
      + id                          = (known after apply)
      + location                    = "uksouth"
      + name                        = "aks00-dev-agw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "ss-dev-network-rg"
      + tags                        = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + zones                       = [
          + "1",
          + "2",
          + "3",
        ]

      + autoscale_configuration {
          + max_capacity = 10
          + min_capacity = 2
        }

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "darts-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "darts-gateway"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "lgy-iac-web"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "toffee-recipe-backend"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "vh-bookings-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "vh-notification-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "vh-test-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "vh-user-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.145.15.250",
              + "10.145.31.250",
            ]
          + name         = "vh-video-api"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "darts-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "darts-api"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "darts-gateway"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "darts-gateway"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "lgy-iac-web"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "lgy-iac-web"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "toffee-recipe-backend"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "toffee-recipe-backend"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "vh-bookings-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "vh-bookings-api"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "vh-notification-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "vh-notification-api"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "vh-test-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "vh-test-api"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "vh-user-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "vh-user-api"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "vh-video-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "vh-video-api"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPublicFrontendIp"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/publicIPAddresses/aks-appgw-dev-pip"
        }
      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPrivateFrontendIp"
          + private_ip_address            = "10.145.32.135"
          + private_ip_address_allocation = "Static"
          + private_link_configuration_id = (known after apply)
          + subnet_id                     = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-appgw"
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "http"
          + port = 80
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "https"
          + port = 443
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "gateway"
          + subnet_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-appgw"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "http"
          + host_name                      = "toffee-recipe-backend.dev.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "toffee-recipe-backend"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "darts-api.dev.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "darts-api"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-dev-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "darts-gateway.dev.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "darts-gateway"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-dev-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "lgy-iac-web.dev.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "lgy-iac-web"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-dev-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "vh-bookings-api.dev.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vh-bookings-api"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-dev-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "vh-notification-api.dev.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vh-notification-api"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-dev-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "vh-test-api.dev.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vh-test-api"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-dev-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "vh-user-api.dev.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vh-user-api"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-dev-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "vh-video-api.dev.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "vh-video-api"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-dev-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-dev-agw",
            ]
          + type         = "UserAssigned"
        }

      + probe {
          + host                                      = "darts-api.dev.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "darts-api"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "darts-gateway.dev.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "darts-gateway"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "lgy-iac-web.dev.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "lgy-iac-web"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "toffee-recipe-backend.dev.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "toffee-recipe-backend"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "vh-bookings-api.dev.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "vh-bookings-api"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "vh-notification-api.dev.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "vh-notification-api"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "vh-test-api.dev.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "vh-test-api"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "vh-user-api.dev.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "vh-user-api"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "vh-video-api.dev.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "vh-video-api"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "darts-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "darts-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "darts-api"
          + id                         = (known after apply)
          + name                       = "darts-api"
          + priority                   = 80
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "darts-gateway"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "darts-gateway"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "darts-gateway"
          + id                         = (known after apply)
          + name                       = "darts-gateway"
          + priority                   = 90
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "lgy-iac-web"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "lgy-iac-web"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "lgy-iac-web"
          + id                         = (known after apply)
          + name                       = "lgy-iac-web"
          + priority                   = 70
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "toffee-recipe-backend"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "toffee-recipe-backend"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "toffee-recipe-backend"
          + id                         = (known after apply)
          + name                       = "toffee-recipe-backend"
          + priority                   = 10
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "vh-bookings-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "vh-bookings-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "vh-bookings-api"
          + id                         = (known after apply)
          + name                       = "vh-bookings-api"
          + priority                   = 60
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "vh-notification-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "vh-notification-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "vh-notification-api"
          + id                         = (known after apply)
          + name                       = "vh-notification-api"
          + priority                   = 50
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "vh-test-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "vh-test-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "vh-test-api"
          + id                         = (known after apply)
          + name                       = "vh-test-api"
          + priority                   = 40
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "vh-user-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "vh-user-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "vh-user-api"
          + id                         = (known after apply)
          + name                       = "vh-user-api"
          + priority                   = 20
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "vh-video-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "vh-video-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "vh-video-api"
          + id                         = (known after apply)
          + name                       = "vh-video-api"
          + priority                   = 30
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + name = "Standard_v2"
          + tier = "Standard_v2"
        }

      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + ssl_policy {
          + min_protocol_version = "TLSv1_2"
          + policy_name          = "AppGwSslPolicy20220101S"
          + policy_type          = "Predefined"
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "AppGw"
      + target_resource_id             = (known after apply)
    }

  # module.privatedns.azurerm_private_dns_a_record.this["darts-api"] will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "this" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/dev.platform.hmcts.net/A/darts-api"
        name                = "darts-api"
      ~ records             = [
          - "10.145.32.134",
          + "10.145.32.135",
        ]
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # module.privatedns.azurerm_private_dns_a_record.this["darts-gateway"] will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "this" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/dev.platform.hmcts.net/A/darts-gateway"
        name                = "darts-gateway"
      ~ records             = [
          - "10.145.32.134",
          + "10.145.32.135",
        ]
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # module.privatedns.azurerm_private_dns_a_record.this["lgy-iac-web"] will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "this" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/dev.platform.hmcts.net/A/lgy-iac-web"
        name                = "lgy-iac-web"
      ~ records             = [
          - "10.145.32.134",
          + "10.145.32.135",
        ]
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # module.privatedns.azurerm_private_dns_a_record.this["toffee-recipe-backend"] will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "this" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/dev.platform.hmcts.net/A/toffee-recipe-backend"
        name                = "toffee-recipe-backend"
      ~ records             = [
          - "10.145.32.134",
          + "10.145.32.135",
        ]
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-bookings-api"] will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "this" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/dev.platform.hmcts.net/A/vh-bookings-api"
        name                = "vh-bookings-api"
      ~ records             = [
          - "10.145.32.134",
          + "10.145.32.135",
        ]
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-notification-api"] will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "this" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/dev.platform.hmcts.net/A/vh-notification-api"
        name                = "vh-notification-api"
      ~ records             = [
          - "10.145.32.134",
          + "10.145.32.135",
        ]
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-test-api"] will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "this" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/dev.platform.hmcts.net/A/vh-test-api"
        name                = "vh-test-api"
      ~ records             = [
          - "10.145.32.134",
          + "10.145.32.135",
        ]
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-user-api"] will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "this" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/dev.platform.hmcts.net/A/vh-user-api"
        name                = "vh-user-api"
      ~ records             = [
          - "10.145.32.134",
          + "10.145.32.135",
        ]
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # module.privatedns.azurerm_private_dns_a_record.this["vh-video-api"] will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "this" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/dev.platform.hmcts.net/A/vh-video-api"
        name                = "vh-video-api"
      ~ records             = [
          - "10.145.32.134",
          + "10.145.32.135",
        ]
        tags                = {}
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 9 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":457,"Program":"tfcmt","SHA1":"","Target":"dev-backendappgateway","Vars":{}} -->